In [107]:
# Add the pandas dependencies
import pandas as pd
import os

In [108]:
# File to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# read the school data file and store it in a Pandas Dataframe.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

# Read the student data file' head (firt5 rows) and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [109]:
# Determine if there are any missing values in the school data (using the .count method).
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [110]:
# Determine if there are any missing values in the student data ( using the .count method).
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [111]:
# Determine if there are any missing values in the school data (using the .isnull method).
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [112]:
# Determine if there are any missing values in the student data (using the .isnull method).
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [113]:
# Determine if there are any missing values in the student data (using the .isnull and the .sum panda methods).
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [114]:
# Determine if there are not any missing values in the school data (using the .notnull method).
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [115]:
# Determine if there are not any missing values in the student data (by chaining the .notnull and .sum methods together).
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [116]:
# Determine the data types for the school DataFrame.
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [117]:
# Determine the data type of the budget column in the school DataFrame. 
# (use df.column.dtype for when the name of the coulmn doesn't have any spaces).
school_data_df.budget.dtype

dtype('int64')

In [118]:
# another way to determine the data type of the budget column in the school DataFrame. (use df["column"].dtype, if the name of the column have spaces).
school_data_df["budget"].dtype

dtype('int64')

In [119]:
# Determine data types for the student DataFrame.
student_data_df.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [120]:
# Create a list named prefixes_suffixes, to hold each prefix and suffix to be removed.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [121]:
# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")        
student_data_df.head(10)

/Users/biancapommerening/opt/anaconda3/envs/PythonData/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  This is separate from the ipykernel package so we can avoid doing imports until

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [122]:
# 1. Merge DataFrames by combining the data into a single dataset.
# A. Create a new DataFrame for the merged DataFrames, called school_data_complete_df.
# B.  The new DataFrame is created as a result of merging DataFrame #2 (school_data_df),
# which is the "right" DataFrame, into DataFrame #1 (student_data_df), which is the "left" DataFrame.
# We refer to the DataFrames as "left" and "right" to reflect the order they appear inside the parentheses.
# C. We use the parameter "on," which is equal to a list of the columns that are identical from each DataFrame,
# in this case, "school_name." We can also use the column name like this: on="school_name".
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [123]:
# 2. Get the number of Students.
# A. Get the total number of students using the count() method.
#student_count = school_data_complete_df.count()
#student_count
# B. Get the student count from a chosen column. In this case, to assign the
# "student_count" to a column that identifies with students, we will use the "Student ID" column.
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [124]:
# 3. Get the number of schools (Calculate the total number of schools):
# A. create a variable called "school_count" and difne it as the "school_data_df["school_name"].count()",
# where the method "count()" is being applyed to the column "school name" from the "school_data_df" 

school_count = school_data_df["school_name"].count()
school_count

15

In [125]:
# 4. Calculate the total number of schools using the unique () method.
# A. using the unique() method on a Series is a "ndarray" of all the high schools.
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2
# B. getting the number of schools from the array above.
len(school_data_complete_df["school_name"].unique())

15

In [126]:
# 5. Get the total Budget.
# A. Calculate the total budget, by creating a new variable called "total_budget",
# and applying the sum() method to the school_data_df.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [127]:
# 6. Get the Score Averages.
# A. Find the Average Reading Score, by calculating it using the mean() method.
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [128]:
# B. Find the Average Math Score, by calculating it using the mean() method.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [129]:
# 7. GET THE PASSING PERCENTAGES.
# A. Determine the Passing Grade by assigning a "passing_math" variable to the "math_score" column
# in "school_data_complete_df", where all the math scores are equal to or greater than 70.
passing_math = school_data_complete_df["math_score"] >= 70
passing_math.head()

0     True
1    False
2    False
3    False
4     True
Name: math_score, dtype: bool

In [130]:
passing_reading = school_data_complete_df["reading_score"] >= 70
passing_reading.head()

0    False
1     True
2     True
3    False
4     True
Name: reading_score, dtype: bool

In [131]:
# B. Get the Number of Students Who Passed Math and Reading.
# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [132]:
# C. Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [133]:
# D. Calculate the number of students who passed math.
passing_math_count = passing_math["student_name"].count()
print(passing_math_count)

29370

In [134]:
# E. Calculate the number of students who passed reading.
passing_reading_count = passing_reading["student_name"].count()
print(passing_reading_count)

33610

In [135]:
# F. Get the Percentage of Students Who Passed Math and Reading
# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / student_count * 100

passing_math_percentage

74.9808526933878

In [136]:
# G. Calculate the percent that passed reading.
passing_reading_percentage = passing_reading_count / student_count * 100

passing_reading_percentage

85.80546336482001

In [137]:
# H. Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]
                                      
                                                
passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [138]:
# I. Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [139]:
# J. Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100

overall_passing_percentage

65.17232575950983

In [140]:
# 8. Create a District Summary DataFrame
# create a new dataframe called district_summary_df to hold a summary of all the results found.
#create a list of dictionaries, where the keys are column names and the values are the metrics we calculated.
district_summary_df = pd.DataFrame(
    [{"Total Schools": school_count,
      "Total Students": student_count,
      "Total Budget": total_budget,
      "Average Math Score": average_math_score,
      "Average Reading Score": average_reading_score,
      "% Passing Math": passing_math_percentage,
      "% Passing Reading": passing_reading_percentage,
      "% Overall Passing": overall_passing_percentage}])
    
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [141]:
# 9. Format Columns
# A.  Define a function that calculates the percentage of students that passed both 
# math and reading and returns the passing percentage when the function is called.
def passing_math_percent(pass_math_count, student_count):
    return passing_math_count / student_count * 100

In [142]:
# assign the passing_math_count and the total_student_count variables.
passing_math_count = 29370
total_student_count = 39170
#call the function
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

In [144]:
# Format the "Total Students" to have the comma for a thousands separator.

district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
                                                                                  
district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [148]:
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [153]:
# Format the columns.

district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)


district_summary_df

ValueError: Unknown format code 'f' for object of type 'str'

In [ ]:
district_summary_df["Total Schools"] = district_summary_df["Total Schools"].map("{:,}".format)